app/controllers/processed_sites_controller.rb

  def index
    @processed_sites = ProcessedSite.paginate(:all, :page => params[:page] || 1, :per_page => 20, :order => "div_count DESC")
---
SELECT * FROM `processed_sites` ORDER BY created_at DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `processed_sites`