app/controllers/queued_sites_controller.rb

INSERT INTO `queued_sites` (`user_flag`, `uri`, `updated_at`, `state`, `created_at`) VALUES(0, NULL, '2009-02-28 06:54:32', NULL, '2009-02-28 06:54:32')
SELECT `queued_sites`.id FROM `queued_sites` WHERE (`queued_sites`.`uri` = BINARY 'http://herokugarden.com/beta') LIMIT 1
---
  def create

    @queued_site = QueuedSite.new(params[:queued_site])

    if @queued_site.valid?
      @queued_site.save
      flash[:notice] = "#{@queued_site.uri} has been added to the list."
    else
      flash[:error] = "Nope.  Don't think so. #{@queued_site.errors.full_messages.join(". ")}"